In [2]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Mike','Alice','Bob'],
    'age': [30,45,80],
    'job': ['Programmer','Designer','Accountant']
    }
)
df = df.set_index('name')

In [3]:
df.loc['Salohiddin'] =[19,'ML engineer']

In [4]:
df.at['Alice','age']=float('nan')
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Mike to Salohiddin
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3 non-null      float64
 1   job     4 non-null      object
dtypes: float64(1), object(1)
memory usage: 268.0+ bytes

In [6]:
df

             age          job
name
Mike        30.0   Programmer
Alice        NaN     Designer
Bob         80.0   Accountant
Salohiddin  19.0  ML engineer

In [ ]:
df.dropna()
# df.dropna() this finction deletes all thw rows that has a NaN value

             age          job
name
Mike        30.0   Programmer
Bob         80.0   Accountant
Salohiddin  19.0  ML engineer

In [10]:
df.fillna(0)
# df.fillna(0) this fills rows that has a NaN value with any number you entered

             age          job
name
Mike        30.0   Programmer
Alice        0.0     Designer
Bob         80.0   Accountant
Salohiddin  19.0  ML engineer

In [11]:
df.fillna(df.age.mean())

             age          job
name
Mike        30.0   Programmer
Alice       43.0     Designer
Bob         80.0   Accountant
Salohiddin  19.0  ML engineer

In [12]:
df.at['Bob','job'] = None

In [13]:
df

             age          job
name
Mike        30.0   Programmer
Alice        NaN     Designer
Bob         80.0         None
Salohiddin  19.0  ML engineer

In [14]:
df.notna(
    
)

              age    job
name
Mike         True   True
Alice       False   True
Bob          True  False
Salohiddin   True   True

In [15]:
df[df.age.notna()]

             age          job
name
Mike        30.0   Programmer
Bob         80.0         None
Salohiddin  19.0  ML engineer

In [16]:
df.iterrows()

In [ ]:
for i , row in df.iterrows():
    print(row)

age          30.0
job    Programmer
Name: Mike, dtype: object
age         NaN
job    Designer
Name: Alice, dtype: object
age    80.0
job    None
Name: Bob, dtype: object
age           19.0
job    ML engineer
Name: Salohiddin, dtype: object